In [1]:
import numpy as np
import pandas as pd
from env import get_db_url

In [3]:
url = get_db_url('employees')

sql = 'SELECT * FROM employees'
emp = pd.read_sql(sql, url)

sql = 'SELECT * FROM salaries'
sal = pd.read_sql(sql, url)

In [4]:
sql = 'SELECT * FROM titles'
titles = pd.read_sql(sql, url)

In [32]:
sql = 'SELECT * FROM dept_emp'
de = pd.read_sql(sql, url)

find the unique titles in the titles table

In [6]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

find all unique last names that start and end with e

In [8]:
emp.last_name[emp.last_name.str.startswith('E') & emp.last_name.str.endswith('e')].unique()

array(['Erde', 'Eldridge', 'Etalle', 'Erie', 'Erbe'], dtype=object)

find all unique combinations of first and last name whose last name start and end with e

In [15]:
(
    emp[['first_name', 'last_name']][emp.last_name.str.startswith('E') & emp.last_name.str.endswith('e')]
    .groupby(['first_name', 'last_name']).count()
)

Empty DataFrame
Columns: []
Index: [(Aamod, Erde), (Abdelaziz, Eldridge), (Abdelkader, Eldridge), (Abdelkader, Erbe), (Abdelwaheb, Eldridge), (Abdelwaheb, Erbe), (Abdulla, Erie), (Achilleas, Erde), (Achilleas, Erie), (Adam, Erie), (Adamantios, Etalle), (Adas, Erde), (Adas, Etalle), (Adib, Erbe), (Adib, Etalle), (Adil, Etalle), (Adly, Erie), (Aiichiro, Erie), (Akemi, Erde), (Akeno, Etalle), (Aksel, Erde), (Alagu, Erbe), (Alain, Eldridge), (Alejandra, Eldridge), (Alenka, Erde), (Alexius, Erie), (Almudena, Erie), (Along, Erie), (Aloys, Eldridge), (Aloys, Erde), (Alper, Erie), (Amabile, Eldridge), (Angel, Erde), (Angus, Eldridge), (Anwar, Erbe), (Anwar, Erde), (Anwar, Etalle), (Anyuan, Etalle), (Apostol, Erde), (Aram, Eldridge), (Arch, Erie), (Arco, Erie), (Arie, Eldridge), (Aris, Erie), (Armond, Etalle), (Arnd, Erie), (Arno, Erde), (Arno, Erie), (Aron, Erde), (Aron, Erie), (Arra, Erie), (Arra, Etalle), (Arto, Erbe), (Arto, Etalle), (Aruna, Erde), (Aruna, Etalle), (Arunachalam, Erie), (Arunas, Erde), (Arunas, Etalle), (Arve, Erde), (Ashish, Erie), (Atreyi, Eldridge), (Atreyi, Erie), (Avishai, Erbe), (Ayakannu, Eldridge), (Ayonca, Erbe), (Babette, Eldridge), (Babette, Erbe), (Babette, Erde), (Bader, Eldridge), (Bader, Erde), (Baoqiu, Erie), (Baoqiu, Etalle), (Barry, Erde), (Bartek, Eldridge), (Bartek, Erbe), (Barton, Erie), (Baruch, Erbe), (Barun, Erde), (Basant, Erbe), (Basem, Eldridge), (Basil, Erie), (Baziley, Eldridge), (Becky, Erbe), (Becky, Erie), (Becky, Etalle), (Bedrich, Erie), (Berhard, Eldridge), (Berhard, Erde), (Berna, Erbe), (Berna, Etalle), (Bernardo, Erde), (Bernd, Erbe), (Bernd, Etalle), (Bernt, Erie), (Berry, Erde), (Beshir, Erie), (Beshir, Etalle), (Bezalel, Etalle), (Bingning, Eldridge), ...]

[846 rows x 0 columns]

find the unique last names with 'q' but not 'qu'

In [17]:
(
    emp.last_name[
                      emp.last_name.str.lower().str.contains('q')
                  & ~ emp.last_name.str.lower().str.contains('qu')
                 ]
       .unique()
)

array(['Chleq', 'Lindqvist', 'Qiwen'], dtype=object)

add a count function to the query above to find the number of employees with each last name

In [23]:
(
    emp[
            emp.last_name.str.lower().str.contains('q')
        & ~ emp.last_name.str.lower().str.contains('qu')
       ]
       .groupby('last_name').count()
       .emp_no
)

last_name
Chleq        189
Lindqvist    190
Qiwen        168
Name: emp_no, dtype: int64

Find all all employees with first names 'Irena', 'Vidya', or 'Maya'. find the number of employees with each first name

In [27]:
(
    emp[emp.first_name.isin(['Irena', 'Vidya', 'Maya'])]
      .groupby('first_name')
      .count()
      .emp_no
)

first_name
Irena    241
Maya     236
Vidya    232
Name: emp_no, dtype: int64

determine the historic average salary for each employee

In [31]:
sal.groupby('emp_no').mean()

              salary
emp_no
10001   75388.941176
10002   68854.500000
10003   43030.285714
10004   56512.250000
10005   87275.769231
...              ...
499995  45891.666667
499996  63134.142857
499997  66475.866667
499998  46665.555556
499999  70625.000000

[300024 rows x 1 columns]

how many employees work in each department (dept_emp table)

In [35]:
de.groupby('dept_no').count().emp_no

dept_no
d001    20211
d002    17346
d003    17786
d004    73485
d005    85707
d006    20117
d007    52245
d008    21126
d009    23580
Name: emp_no, dtype: int64